String first_hadeth =
    "قَالَ : سَمِعْتُ رَسُولَ اللهِ ﷺ يَقُولُ : \" إِنَّمَا \n"
    "الأَعْمَالُ بِالنِّيَّاتِ ، وَإنَّمَا لِكُلِّ امْرِىءٍ مَا نَوَى ، فَمَنْ \n"
    "كَانَتْ هِجْرَتُهُ إِلى اللهِ وَرَسُوله فَهِجْرتُهُ إلى اللهِ \n"
    "وَرَسُوُله ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيْبُهَا أو مرأة \n"
    "ينكحها فهجرته إلى ما هاجر إليه";
String alrawi = "عَنْ أَمِيرِ المُؤمِنينَ أَبي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ";

List<String> ahadeth_list_number = [
  "الحديث الأول",
  "الحديث الثاني",
  "الحديث الثالث",
  "الحديث الرابع"
];
